In [3]:
import l12_calc

print(l12_calc.add(11,22))

13

In [4]:
import l12_calc as calc

print(calc.add(11,22))

33

In [5]:
from l12_calc import add

print(add(11,22))

33

In [1]:
from l12_calc import Multi

multi=Multi(11,22)
print(multi.mul())

242

In [1]:
import os
import sys
import random

print(os.getcwd())
print(sys.path)
print(random.random())

/Users/som/VsProjects/kosmo_python_2025_06/ex
['/Library/Frameworks/Python.framework/Versions/3.14/lib/python314.zip', '/Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14', '/Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/lib-dynload', '', '/Users/som/VsProjects/kosmo_python_2025_06/.venv/lib/python3.14/site-packages']
0.16638223101370586

In [6]:
import pandas as pd

s = pd.Series([1, 2, 3, 4])
# print(s)
s

0    1
1    2
2    3
3    4
dtype: int64

In [7]:
data = {
    "name": ["Kim", "Lee", "Park"],
    "age": [20, 30, 40]
}

df = pd.DataFrame(data)
# print(df)
df

   name  age
0   Kim   20
1   Lee   30
2  Park   40

In [11]:
data=pd.read_csv("data.csv")
df = pd.DataFrame(data)
df

   name  age  score     city
0   Kim   25   88.0    Seoul
1   Lee   30   92.0    Busan
2  Park   28   76.0  Incheon
3  Choi   35   85.0    Daegu
4  Jung   22   90.0    Seoul
5   Han   40   70.0  Gwangju
6  Yoon   33   95.0    Busan
7  Kang   27   82.0  Incheon
8   Lim   29    NaN    Seoul
9  Shin   31   78.0    Daegu

In [13]:
print(df.isnull().sum())

name     0
age      0
score    1
city     0
dtype: int64

In [18]:
print(df["score"].mean())
df["score"].fillna(df["score"].mean(), inplace=True) #결측치를 평균으로 처리

df=df.sort_values(by="score", ascending=False) #점수로 정렬
df

84.0

   name  age  score     city
6  Yoon   33   95.0    Busan
1   Lee   30   92.0    Busan
4  Jung   22   90.0    Seoul
0   Kim   25   88.0    Seoul
3  Choi   35   85.0    Daegu
8   Lim   29   84.0    Seoul
7  Kang   27   82.0  Incheon
9  Shin   31   78.0    Daegu
2  Park   28   76.0  Incheon
5   Han   40   70.0  Gwangju

In [20]:
df=df.groupby("city")["score"].mean()
df

city
Busan      93.500000
Daegu      81.500000
Gwangju    70.000000
Incheon    79.000000
Seoul      87.333333
Name: score, dtype: float64